{"vocabulary": ["accumulation", "across", "add", "address", "adjacent", "algorithms", "always", "annotate", "append", "args", "assert", "attributes", "avoid", "bare", "base", "before", "best", "binary", "boolean", "boundary", "bubble", "built", "calculate_total", "calls", "case", "cases", "ceil", "celsius", "check", "checks", "class", "collections", "compare", "comparisons", "comprehensions", "computed", "constants", "content", "context", "conventions", "convert_celsius", "count", "counter", "create", "custom", "data", "debugging", "deduplication", "deep", "def", "default", "defaultdict", "define", "denominator", "deque", "dequeue", "descriptive", "dict", "digits", "dirs", "divide", "division", "docstring", "domain", "dot", "double", "edge", "element", "elements", "email", "empty", "ends", "enqueue", "entry", "enumerate", "error", "every", "example", "except", "exception", "exceptions", "exist_ok", "exists", "expected", "expected_type", "factorial", "fahrenheit", "fib", "fibonacci", "file", "filter", "find", "first", "float", "floor", "formatting", "front", "func", "function", "functional", "functions", "functools", "gcd", "get_user", "half", "halves", "handling", "hello", "hints", "include", "index", "input", "inputs", "insensitive", "int", "integer", "invalid", "is_empty", "is_valid", "isinstance", "items", "iterate", "join", "key", "keyerror", "keys", "lambda", "large", "left", "len", "length", "limit", "line", "lines", "list", "lists", "log", "logic", "lookup", "lower", "lru_cache", "manager", "map", "math", "max_val", "membership", "memoization", "merge", "methods", "middle", "min_val", "minimum", "missing", "mkdir", "module", "modulo", "multiple", "must", "name", "names", "naming", "need", "negative", "non", "none", "numbers", "numerator", "object", "occurrences", "one", "only", "oop", "open", "operations", "operator", "optional", "order", "out", "pair", "palindrome", "parameters", "parents", "parsing", "pascalcase", "path", "patterns", "peek", "pep", "phone", "point", "pop", "popleft", "power", "practices", "present", "prime", "programming", "property", "push", "pytest", "python", "queue", "quotes", "raise", "raises", "range", "read", "readlines", "recomputation", "recursion", "reduce", "remove", "repeat", "representation", "requires", "result", "return", "returns", "reverse", "right", "runtimeerror", "search", "sections", "select", "selection", "self", "set", "should", "simple", "size", "snake_case", "sort", "sorted", "sorting", "spaces", "specific", "split", "sqrt", "stack", "start", "statements", "states", "staticmethod", "stop", "str", "string", "strings", "strip", "structures", "substring", "swap", "test", "test_", "testing", "text", "thing", "timsort", "together", "top", "total_price", "transform", "transformations", "transforms", "trial", "triple", "true", "tuple", "two", "type", "typeerror", "types", "typing", "unexpected", "upper", "upper_case", "user_count", "uses", "utility", "validate", "validation", "value", "valueerror", "values", "variable", "variables", "verbs", "whitespace", "words", "write", "wrong", "you", "zero", "zip"], "vocab_index": {"accumulation": 0, "across": 1, "add": 2, "address": 3, "adjacent": 4, "algorithms": 5, "always": 6, "annotate": 7, "append": 8, "args": 9, "assert": 10, "attributes": 11, "avoid": 12, "bare": 13, "base": 14, "before": 15, "best": 16, "binary": 17, "boolean": 18, "boundary": 19, "bubble": 20, "built": 21, "calculate_total": 22, "calls": 23, "case": 24, "cases": 25, "ceil": 26, "celsius": 27, "check": 28, "checks": 29, "class": 30, "collections": 31, "compare": 32, "comparisons": 33, "comprehensions": 34, "computed": 35, "constants": 36, "content": 37, "context": 38, "conventions": 39, "convert_celsius": 40, "count": 41, "counter": 42, "create": 43, "custom": 44, "data": 45, "debugging": 46, "deduplication": 47, "deep": 48, "def": 49, "default": 50, "defaultdict": 51, "define": 52, "denominator": 53, "deque": 54, "dequeue": 55, "descriptive": 56, "dict": 57, "digits": 58, "dirs": 59, "divide": 60, "division": 61, "docstring": 62, "domain": 63, "dot": 64, "double": 65, "edge": 66, "element": 67, "elements": 68, "email": 69, "empty": 70, "ends": 71, "enqueue": 72, "entry": 73, "enumerate": 74, "error": 75, "every": 76, "example": 77, "except": 78, "exception": 79, "exceptions": 80, "exist_ok": 81, "exists": 82, "expected": 83, "expected_type": 84, "factorial": 85, "fahrenheit": 86, "fib": 87, "fibonacci": 88, "file": 89, "filter": 90, "find": 91, "first": 92, "float": 93, "floor": 94, "formatting": 95, "front": 96, "func": 97, "function": 98, "functional": 99, "functions": 100, "functools": 101, "gcd": 102, "get_user": 103, "half": 104, "halves": 105, "handling": 106, "hello": 107, "hints": 108, "include": 109, "index": 110, "input": 111, "inputs": 112, "insensitive": 113, "int": 114, "integer": 115, "invalid": 116, "is_empty": 117, "is_valid": 118, "isinstance": 119, "items": 120, "iterate": 121, "join": 122, "key": 123, "keyerror": 124, "keys": 125, "lambda": 126, "large": 127, "left": 128, "len": 129, "length": 130, "limit": 131, "line": 132, "lines": 133, "list": 134, "lists": 135, "log": 136, "logic": 137, "lookup": 138, "lower": 139, "lru_cache": 140, "manager": 141, "map": 142, "math": 143, "max_val": 144, "membership": 145, "memoization": 146, "merge": 147, "methods": 148, "middle": 149, "min_val": 150, "minimum": 151, "missing": 152, "mkdir": 153, "module": 154, "modulo": 155, "multiple": 156, "must": 157, "name": 158, "names": 159, "naming": 160, "need": 161, "negative": 162, "non": 163, "none": 164, "numbers": 165, "numerator": 166, "object": 167, "occurrences": 168, "one": 169, "only": 170, "oop": 171, "open": 172, "operations": 173, "operator": 174, "optional": 175, "order": 176, "out": 177, "pair": 178, "palindrome": 179, "parameters": 180, "parents": 181, "parsing": 182, "pascalcase": 183, "path": 184, "patterns": 185, "peek": 186, "pep": 187, "phone": 188, "point": 189, "pop": 190, "popleft": 191, "power": 192, "practices": 193, "present": 194, "prime": 195, "programming": 196, "property": 197, "push": 198, "pytest": 199, "python": 200, "queue": 201, "quotes": 202, "raise": 203, "raises": 204, "range": 205, "read": 206, "readlines": 207, "recomputation": 208, "recursion": 209, "reduce": 210, "remove": 211, "repeat": 212, "representation": 213, "requires": 214, "result": 215, "return": 216, "returns": 217, "reverse": 218, "right": 219, "runtimeerror": 220, "search": 221, "sections": 222, "select": 223, "selection": 224, "self": 225, "set": 226, "should": 227, "simple": 228, "size": 229, "snake_case": 230, "sort": 231, "sorted": 232, "sorting": 233, "spaces": 234, "specific": 235, "split": 236, "sqrt": 237, "stack": 238, "start": 239, "statements": 240, "states": 241, "staticmethod": 242, "stop": 243, "str": 244, "string": 245, "strings": 246, "strip": 247, "structures": 248, "substring": 249, "swap": 250, "test": 251, "test_": 252, "testing": 253, "text": 254, "thing": 255, "timsort": 256, "together": 257, "top": 258, "total_price": 259, "transform": 260, "transformations": 261, "transforms": 262, "trial": 263, "triple": 264, "true": 265, "tuple": 266, "two": 267, "type": 268, "typeerror": 269, "types": 270, "typing": 271, "unexpected": 272, "upper": 273, "upper_case": 274, "user_count": 275, "uses": 276, "utility": 277, "validate": 278, "validation": 279, "value": 280, "valueerror": 281, "values": 282, "variable": 283, "variables": 284, "verbs": 285, "whitespace": 286, "words": 287, "write": 288, "wrong": 289, "you": 290, "zero": 291, "zip": 292}, "doc_freq": {"type": 2, "dict": 2, "parameters": 2, "example": 3, "types": 2, "annotate": 1, "best": 3, "list": 4, "none": 2, "add": 2, "collections": 2, "values": 2, "return": 2, "hints": 1, "always": 4, "optional": 1, "tuple": 1, "python": 15, "practices": 3, "def": 2, "function": 6, "int": 2, "typing": 1, "returns": 1, "docstring": 1, "conventions": 2, "zero": 2, "float": 1, "double": 1, "triple": 1, "result": 1, "args": 1, "include": 1, "valueerror": 4, "raises": 2, "sections": 1, "numerator": 1, "must": 2, "divide": 2, "quotes": 1, "every": 1, "denominator": 1, "expected": 1, "typeerror": 2, "states": 1, "handling": 1, "bare": 1, "non": 2, "inputs": 1, "exception": 1, "top": 1, "raise": 2, "wrong": 1, "error": 1, "validate": 2, "isinstance": 2, "invalid": 1, "unexpected": 1, "negative": 2, "specific": 1, "except": 1, "runtimeerror": 1, "snake_case": 1, "variables": 1, "total_price": 1, "functions": 2, "constants": 1, "variable": 1, "naming": 1, "upper_case": 1, "class": 2, "is_valid": 1, "should": 2, "convert_celsius": 1, "names": 2, "verbs": 1, "user_count": 1, "descriptive": 1, "pascalcase": 1, "get_user": 1, "pep": 1, "calculate_total": 1, "items": 1, "sort": 2, "zip": 2, "iterate": 1, "multiple": 1, "key": 2, "boolean": 1, "length": 2, "checks": 2, "together": 2, "lists": 2, "index": 1, "transformations": 1, "operations": 4, "patterns": 3, "len": 2, "enumerate": 1, "sorted": 2, "custom": 1, "words": 2, "value": 2, "comprehensions": 1, "need": 1, "you": 1, "limit": 1, "recomputation": 1, "case": 2, "recursion": 1, "fib": 1, "default": 1, "first": 1, "define": 2, "calls": 1, "factorial": 1, "fibonacci": 1, "deep": 1, "stop": 1, "base": 1, "functools": 2, "avoid": 2, "lru_cache": 1, "memoization": 1, "upper": 1, "lower": 1, "remove": 1, "reverse": 1, "formatting": 1, "palindrome": 1, "check": 4, "string": 2, "strings": 1, "whitespace": 1, "insensitive": 1, "strip": 2, "join": 1, "count": 2, "hello": 1, "substring": 1, "name": 1, "parsing": 1, "text": 2, "comparisons": 1, "split": 1, "right": 1, "uses": 2, "compare": 1, "selection": 1, "algorithms": 1, "sorting": 1, "log": 1, "repeat": 1, "find": 1, "minimum": 1, "swap": 1, "element": 1, "binary": 1, "built": 1, "bubble": 1, "elements": 3, "left": 1, "search": 1, "half": 1, "merge": 1, "input": 3, "front": 2, "order": 1, "out": 1, "middle": 1, "adjacent": 1, "timsort": 1, "halves": 1, "requires": 1, "keyerror": 1, "structures": 1, "counter": 1, "occurrences": 1, "missing": 1, "membership": 1, "ends": 1, "data": 1, "set": 1, "keys": 1, "append": 1, "deque": 1, "stack": 2, "defaultdict": 1, "testing": 1, "deduplication": 1, "lookup": 1, "pop": 2, "queue": 2, "popleft": 1, "thing": 1, "edge": 1, "statements": 1, "start": 1, "one": 2, "pytest": 1, "test_": 1, "large": 1, "exceptions": 1, "boundary": 1, "only": 1, "func": 1, "assert": 1, "numbers": 2, "empty": 1, "test": 1, "cases": 1, "sqrt": 1, "modulo": 1, "module": 1, "math": 1, "gcd": 1, "ceil": 1, "power": 1, "integer": 1, "prime": 1, "celsius": 1, "operator": 1, "trial": 1, "fahrenheit": 1, "division": 1, "floor": 1, "spaces": 1, "max_val": 1, "phone": 1, "entry": 1, "before": 1, "logic": 1, "email": 1, "point": 1, "address": 1, "dot": 1, "expected_type": 1, "present": 1, "domain": 1, "digits": 1, "min_val": 1, "validation": 1, "range": 1, "push": 1, "methods": 1, "staticmethod": 1, "enqueue": 1, "debugging": 1, "self": 1, "attributes": 1, "object": 1, "utility": 1, "oop": 1, "is_empty": 1, "property": 1, "computed": 1, "representation": 1, "size": 1, "peek": 1, "dequeue": 1, "transforms": 1, "across": 1, "filter": 1, "select": 1, "map": 1, "functional": 1, "str": 1, "lambda": 1, "transform": 1, "reduce": 1, "two": 1, "line": 1, "pair": 1, "programming": 1, "accumulation": 1, "simple": 1, "dirs": 1, "read": 1, "exist_ok": 1, "mkdir": 1, "readlines": 1, "file": 1, "write": 1, "manager": 1, "exists": 1, "context": 1, "open": 1, "path": 1, "create": 1, "content": 1, "true": 1, "lines": 1, "parents": 1}, "num_docs": 15, "dimension": 293}